; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	thermograph0 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image2)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star0)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument7 image2)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared1)
	(supports instrument8 image2)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph0)
	(supports instrument9 image2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite2 GroundStation4)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 infrared1)
	(have_image Planet11 image2)
	(have_image Planet12 image2)
	(have_image Phenomenon13 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation4 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 groundstation4)
   goals met: 1 of 10
2. (turn_to satellite1 groundstation1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 10
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
4. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 10
5. (turn_to satellite1 phenomenon8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 10
6. (take_image satellite1 phenomenon8 instrument2 image2)
   added: (have_image phenomenon8 image2)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon6 instrument2 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon5 instrument2 image2)
   added: (have_image phenomenon5 image2)
   goals met: 4 of 10
11. (turn_to satellite1 phenomenon13 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 10
12. (take_image satellite1 phenomenon13 instrument2 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 5 of 10
13. (turn_to satellite1 phenomenon9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 10
14. (take_image satellite1 phenomenon9 instrument2 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 6 of 10
15. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 6 of 10
16. (take_image satellite1 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 7 of 10
17. (turn_to satellite1 planet11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet11)
   goals met: 7 of 10
18. (take_image satellite1 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   goals met: 8 of 10
19. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 8 of 10
20. (take_image satellite1 planet12 instrument2 image2)
   added: (have_image planet12 image2)
   goals met: 9 of 10
21. (turn_to satellite1 planet7 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet7)
   goals met: 9 of 10
22. (take_image satellite1 planet7 instrument2 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 10 of 10
